app/controllers/movies_controller.rb

  def index
    # @movies = Movie.all
    @sort_column = params[:sort] || 'title'
    @sort_direction = params[:direction] || 'asc'
    @movies = Movie.order("#{@sort_column} #{@sort_direction}")
---
SELECT "movies".* FROM "movies" ORDER BY release_date desc

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "ABC100"], ["updated_at", "2024-09-10 00:07:46.536955"], ["id", 17]]